In [1]:
print('Hello, Dasha!')

Hello, Dasha!

In [20]:
import pandas as pd
import numpy as np

data = [[252, 70, 4.7, 7], [300, 55, 3, 10], [202, 67, 5, 5], [np.NaN, 12, 4.5, 5], [np.NaN, np.NaN, 2.5, 10], [111, 64, np.NaN, np.NaN]]
df = pd.DataFrame(data, columns=['visiting', 'study_hours', 'average_score', 'tutor_hours'])
df

   visiting  study_hours  average_score  tutor_hours
0     252.0         70.0            4.7          7.0
1     300.0         55.0            3.0         10.0
2     202.0         67.0            5.0          5.0
3       NaN         12.0            4.5          5.0
4       NaN          NaN            2.5         10.0
5     111.0         64.0            NaN          NaN

In [21]:
df.isnull().sum()

visiting         2
study_hours      1
average_score    1
tutor_hours      1
dtype: int64

In [23]:
df_cleaned_1 = df.drop('visiting', axis=1)
df_cleaned_1

   study_hours  average_score  tutor_hours
0         70.0            4.7          7.0
1         55.0            3.0         10.0
2         67.0            5.0          5.0
3         12.0            4.5          5.0
4          NaN            2.5         10.0
5         64.0            NaN          NaN

In [24]:
df_cleaned_2 = df.dropna()
df_cleaned_2

   visiting  study_hours  average_score  tutor_hours
0     252.0         70.0            4.7          7.0
1     300.0         55.0            3.0         10.0
2     202.0         67.0            5.0          5.0

In [25]:
df_cleaned_3 = df.fillna(0)
df_cleaned_3

   visiting  study_hours  average_score  tutor_hours
0     252.0         70.0            4.7          7.0
1     300.0         55.0            3.0         10.0
2     202.0         67.0            5.0          5.0
3       0.0         12.0            4.5          5.0
4       0.0          0.0            2.5         10.0
5     111.0         64.0            0.0          0.0

In [26]:
mean_values = df.mean().to_dict()
df.fillna(mean_values, inplace=True)
print(mean_values)
df

{'visiting': 216.25, 'study_hours': 53.6, 'average_score': 3.94, 'tutor_hours': 7.4}

   visiting  study_hours  average_score  tutor_hours
0    252.00         70.0           4.70          7.0
1    300.00         55.0           3.00         10.0
2    202.00         67.0           5.00          5.0
3    216.25         12.0           4.50          5.0
4    216.25         53.6           2.50         10.0
5    111.00         64.0           3.94          7.4